/*
 Licensing.strings
 TGPro
 
 Created by Matt Austin on 2025-06-25.
 Copyright © 2025 Tunabelly Software. All rights reserved.
 */

"LicenseServiceError.requestConstructionFailed" = "Failed to prepare the request. Please try again.";
"LicenseServiceError.requestInvalid"            = "The request to the server failed. Please try again later.";
"LicenseServiceError.network"                   = "Unable to reach the licensing server.\n\nPlease check your Internet connection or try again later.";
"LicenseServiceError.offline"                   = "No internet connection detected. Check the network connection and try again.";
"LicenseServiceError.invalidParameters"         = "The licesning request could not be processed: %@.";
"LicenseServiceError.productNotFound"           = "Invalid product identifier.";
"LicenseServiceError.localStorageFailed"        = "Unable to save licensing information (%@).";
"LicenseServiceError.localLoadFailed"           = "Unable to read licensing information (%@).";
"LicenseServiceError.malformedResponse"         = "Received an unexpected response from the server.";
"LicenseServiceError.dbConnection"              = "Unable to connect to the licensing database. Please try again later.";
"LicenseServiceError.internalServer"            = "An internal server error occurred. Please try again later.";
"LicenseServiceError.unknownStatusCode"         = "Received an unexpected server response (%d - %@)";

"LicenseActivationError.activationLimitReached"    = "Activation limit reached (%d of %d devices already in use).";
"LicenseActivationError.revoked"                   = "This license is no longer valid.";
"LicenseActivationError.revokedRefundWithDate"     = "This purchase was refunded on %@.\n\nThe license is no longer valid.";
"LicenseActivationError.revokedRefund"             = "This purchase was refunded. The license is no longer valid.";
"LicenseActivationError.expired"                   = "This licence has expired.";
"LicenseActivationError.licenseNotFound"           = "The license key is incorrect.";

"LicenseDeactivationError.licenseNotFound" = "The licence details could not be found.";

"LicenseOnlineInvalidated.title" = "License status updated";
"LicenseOnlineInvalidated.bodySuffix" = "Please enter a valid license key to continue.";

"LicensingVerificationError.notFound" = "The licence details could not be found.";
"LicensingVerificationError.notActivated" = "The previous licence is no longer active for this installation of TG Pro.";
"LicensingVerificationError.revoked" = "The licence is no longer valid.";
"LicensingVerificationError.revokedRefund" = "The purchase was refunded and the licence is no longer valid.";
"LicensingVerificationError.expired" = "The licence has expired.";
"LicensingVerificationError.activationLimitReached" = "The activation limit has been reached (%d of %d devices already in use).";

"TrialError.expired"            = "The trial period has ended.";
"TrialError.invalidSignature"   = "Trial information could not be verified.";
"TrialError.malformedToken"     = "The trial data is corrupt.";
"TrialError.invalidMac"         = "Trial data does not belong to this Mac.";
"TrialError.invalidSystemClock" = "The system clock appears to be inaccurate. Adjust the date and time, then try again.";

"TLS.local_error.title"             = "Licensing Error";
"TLS.local_error.body"              = "There was an issue with the licensing system. If the problem persists, please contact Tunabelly Software support and include the following message:\n\n%@";

"TLS.error.no_window"               = "Licensing window is not available";

"LicensingState.activated"                  = "Activated for %@ (%@) - %d/%d activations";
"LicensingState.trialActive"                = "Trial active: %@ remaining";
"LicensingState.trialExpired"               = "Trial expired";
"LicensingState.unlicensed"                 = "Unlicensed";
"LicensingState.checking"                   = "Verifying license information…";

"HardwareIDUnavailableTitle"                = "Cannot launch %@";
"HardwareIDUnavailableBody"                 = "%@ was unable to retrieve the hardware identifier that is required to start the free trial or activate a licence.\n\nRestart the Mac and open TG Pro again.\n\nIf the message re-appears, contact Tunabelly Software support for help.";

"TrialError.invalidSystemClock.title" = "Incorrect System Time";
"TrialError.invalidSystemClock.body" = "The system clock appears to be inaccurate. Please adjust the date and time, then start the trial again.";

"SystemClockNeedsRefresh.title" = "Trial Verification";
"SystemClockNeedsRefresh.body" = "TG Pro needs to check with the server to verify the remaining trial days but could not connect.\n\nIf the connection is blocked, please allow access and open TG Pro again.";

"SystemClockValid" = "The system time is valid.";
"SystemClockModified" = "The system time appears to have been modified. Please ensure that the system clock is set correctly.";
"SystemClockNeedsRefresh" = "TG Pro needs to refresh the system clock information from the server.";
"MonotonicTimeError" = "An unexpected issue with the system clock was detected. Please restart the system and try again.";

"StatusItemTrialOver" = "Trial Over";
"StatusItemUnlicensed" = "Unlicensed";

"LicenseAlreadyActivatedTitle" = "License Already Activated";
"LicenseAlreadyActivatedBody" = "TG Pro is already activated on this Mac and ready to use.";




